var data = {
    "0": [
        ['', '0', '', '0', '', '妹,false', '0', '狗,false', '', '0'],
        ['害,false', '0', '耍,false', '', '0', '0', '0', '0', '0', ''],
        ['', '0', '0', '', '0', '0', '', '0', '0', ''],
        ['', '', '', '心,false', '', '', '', '崩,false', '', ''],
        ['', '0', '0', '', '0', '0', '套,false', '0', '0', ''],
        ['', '0', '命,false', '', '0', '', '', '0', '0', '船,false'],
        ['0', '0', '', '0', '0', '0', '', '0', '', '0'],
        ['', '0', '缺,false', '0', '', '渡,false', '', '0', '套,false', ''],
        ['', '0', '', '0', '0', '0', '', '0', '0', '0'],
        ['躺,false', '', '0', '', '石,false', '', '0', '', '4,false', '']
    ],
    "1": [
        ['辣,false', '', '0', '', '', '宝,false', '', '', '0', ''],
        ['0', '智,false', '', '0', '开,false', '0', '0', '解,false', '0', ''],
        ['', '', '0', '0', '0', '0', '0', '0', '单,false', ''],
        ['0', '', '', '', '', '', '', '亿,false', '0', ''],
        ['0', '0', '0', '0', '0', '言,false', '0', '0', '0', ''],
        ['', '', '任,false', '', '0', '', '0', '城,false', '0', '掏,false'],
        ['', '0', '0', '别,false', '0', '', '0', '', '0', ''],
        ['大,false', '0', '', '0', '0', '', '0', '', '0', '0'],
        ['', '0', '久,false', '0', '', '0', '专,false', '0', '0', '0'],
        ['', '0', '', '0', '瘦,false', '', '', '', '', '电,false']
    ],
    "2": [
        ['0', '0', '', '0', '', '塞,false', '', '0', '0', '0', '0'],
        ['', '', '静,false', '', '0', '', '0', '', '', '', '拼,false'],
        ['0', '0', '', '0', '0', '0', '0', '', '0', '0', '0'],
        ['0', '0', '', '0', '0', '', '0', '醉,false', '0', '0', '0'],
        ['我,false', '', '', '', '', '', '', '', '0', '0', '0'],
        ['', '0', '', '0', '0', '', '0', '0', '活,false', '', ''],
        ['', '0', '男,false', '0', '0', '天,false', '0', '0', '', '0', ''],
        ['0', '0', '', '0', '0', '', '0', '0', '', '0', ''],
        ['0', '0', '0', '0', '', '0', '0', '', '0', '0', '0'],
        ['', '', '看,false', '', '质,false', '0', '0', '城,false', '', '', '0']
    ],
    "3": [
        ['北,false', '', '', '0', '0', '0', '', '木,false', '', '0', '0'],
        ['', '0', '0', '0', '0', '0', '0', '0', '', '0', '0'],
        ['', '0', '0', '', '', '', '', '', '不,false', '', ''],
        ['0', '', '0', '0', '0', '0', '0', '0', '', '0', '0'],
        ['', '要,false', '', '', '', '三,false', '', '0', '0', '', '0'],
        ['0', '', '0', '0', '0', '0', '0', '0', '0', '', '0'],
        ['0', '', '0', '0', '0', 'A,false', '', '', '', '蓝,false', '0'],
        ['0', '', '', '0', '', '0', '0', '0', '0', '0', '0'],
        ['0', '0', '', '', '0', '', '0', '0', '0', '吃,false', ''],
        ['0', '', '妹,false', '0', '0', '0', '', '', '', '', '0']
    ]
}
var mydata = {
    "0": [
        ['厉', '0', '玩', '0', '撩', '妹', '0', '狗', '带', '0'],
        ['害', '0', '耍', '宝', '0', '0', '0', '0', '0', '友'],
        ['了', '0', '0', '宝', '0', '0', '总', '0', '0', '谊'],
        ['我', '的', '内', '心', '几', '乎', '是', '崩', '溃', '的'],
        ['的', '0', '0', '里', '0', '0', '套', '0', '0', '小'],
        ['哥', '0', '命', '苦', '0', '套', '路', '0', '0', '船'],
        ['0', '0', '里', '0', '0', '0', '得', '0', '解', '0'],
        ['葛', '0', '缺', '0', '摆', '渡', '人', '0', '套', '吃'],
        ['优', '0', '金', '0', '0', '0', '心', '0', '0', '0'],
        ['躺', '赢', '0', '泥', '石', '流', '0', 'A', '4', '腰']
    ],
    "1": [
        ['辣', '鸡', '0', '吓', '死', '宝', '宝', '了', '0', '感'],
        ['0', '智', '商', '0', '开', '0', '0', '解', '0', '觉'],
        ['比', '如', '0', '0', '0', '0', '0', '0', '单', '身'],
        ['0', '我', '先', '挣', '他', '一', '个', '亿', '0', '体'],
        ['0', '0', '0', '0', '0', '言', '0', '0', '0', '被'],
        ['有', '钱', '任', '性', '0', '不', '0', '城', '0', '掏'],
        ['大', '0', '0', '别', '0', '合', '0', '会', '0', '空'],
        ['大', '0', '活', '0', '0', '就', '0', '玩', '0', '0'],
        ['的', '0', '久', '0', '蓝', '0', '专', '0', '0', '0'],
        ['梦', '0', '见', '0', '瘦', '成', '一', '道', '闪', '电']
    ],
    "2": [
        ['0', '0', '安', '0', '猴', '塞', '雷', '0', '0', '0', '0'],
        ['我', '想', '静', '静', '0', '车', '0', '也', '是', '蛮', '拼'],
        ['0', '0', '地', '0', '0', '0', '0', '是', '0', '0', '0'],
        ['0', '0', '做', '0', '0', '咋', '0', '醉', '0', '0', '0'],
        ['我', '整', '个', '人', '都', '不', '好', '了', '0', '0', '0'],
        ['方', '0', '美', '0', '0', '上', '0', '0', '活', '到', '老'],
        ['了', '0', '男', '0', '0', '天', '0', '0', '久', '0', '司'],
        ['0', '0', '子', '0', '0', '呢', '0', '0', '见', '0', '机'],
        ['0', '0', '0', '0', '潜', '0', '0', '京', '0', '0', '0'],
        ['主', '要', '看', '气', '质', '0', '0', '城', '会', '玩', '0']
    ],
    "3": [
        ['北', '京', '瘫', '0', '0', '0', '伐', '木', '累', '0', '0'],
        ['上', '0', '0', '0', '0', '0', '0', '0', '觉', '0', '0'],
        ['广', '0', '0', '画', '面', '太', '美', '我', '不', '敢', '看'],
        ['0', '偏', '0', '0', '0', '0', '0', '0', '爱', '0', '0'],
        ['重', '要', '的', '话', '说', '三', '遍', '0', '0', '阅', '0'],
        ['0', '靠', '0', '0', '0', '0', '0', '0', '0', '兵', '0'],
        ['0', '才', '0', '0', '0', 'A', 'P', 'E', 'C', '蓝', '0'],
        ['0', '华', '霾', '0', '4', '0', '0', '0', '0', '0', '0'],
        ['0', '0', '迷', '雾', '0', '腰', '0', '0', '0', '吃', '土'],
        ['0', '撩', '妹', '0', '0', '0', '洪', '荒', '之', '力', '0']
    ]
}
var group = ['0,1', '0,2', '0,3', '1,0', '1,2', '1,3', '2,0', '2,1', '2,3', '3,0', '3,1', '3,2'];
var cache = [];
(function() {
    document.onreadystatechange = loading;

    function loading() {
        if (document.readyState == "complete") {
            $(".load").remove();
            $(".container").show();
            var mySwiper = new Swiper('.swiper-container', {
                speed: 1000,
                direction: 'vertical',
                loop: false,
                noSwiping: true
            });
            // 开始游戏
            $(".start_btn").click(function() {
                mySwiper.slideNext();
                cache = group[Math.floor(Math.random() * group.length)].split(',');
                NumberGame.init(cache[NumberGame.count]); //初始化
                // 时间计数
                timer();
            });
        }
    }
}());
var NumberGame = {
    CR: 0,
    _me: null,
    answer: null,
    count: 0,
    init: function(type) {
        var t = this;
        t.CR = data[cache[t.count]].length;
        t.update_page(type);
        $(".public-screen02-content").on('click', '.txt_box', function(e) {
            t._me = $(this);
            t.start(t._me);
            $(this).data('i')=='true'? $(this).html($(this).data('error') == true ? '':$(this).html()):'';
            
        });
        $(".key").click(function(e) {
            $('.txt_box').removeAttr('data-state');
            $('.active').html($(this).html()).attr('data-state', '1');
            t.answer == 38 ? t.start(t._me) : '';
            t.answer == 37 ? t.update_page(cache[++NumberGame.count]) : '';
            console.log(t.answer)
        });
    },
    start: function(me) {
        var t = this;
        if (me.attr('data-i') != "false") {
            $(".txt_box").removeClass('active');
            me.addClass('active');
            if ($('.txt_box[data-state="1"]').length != '0') {
                var this_top = $('.txt_box[data-state="1"]').position().top / 60;
                var this_left = $('.txt_box[data-state="1"]').position().left / 60;
                var this_txt = $('.txt_box[data-state="1"]');

                if (mydata[cache[t.count]][this_top][this_left] != this_txt.html()) {
                    this_txt.css('border-color', 'yellow').attr('data-error','true');

                } else {
                    this_txt.css('border-color', '#e44f25').attr('data-i', 'false');
                    t.answer--;
                }
            }
        }
    },
    update_page: function(GroupName) {
        $(".public-screen02-content").html('');
        // $(".key_box").html('');
        for (var i = 0; i < this.CR; i++) {
            for (var j = 0; j < this.CR; j++) {
                if (data[GroupName][i][j] != '0') {
                    $(".public-screen02-content").append('<div data-i="true" class="txt_box ' + i + j + '">' + data[GroupName][i][j].split(',')[0] + '</div>');
                }
                if (data[GroupName][i][j].split(',')[1] == "false") {
                    $('.' + i + j).css({
                        background: '#fadcd3'
                    }).attr('data-i', 'false');
                }
                $('.' + i + j).css({
                    top: i * 60,
                    left: j * 60
                });
            }
        }
        this.answer = $(".txt_box[data-i='true']").length;
    }
}
function timer() {
    var HH = 0,
        mm = 0,
        ss = 0,
        str = '',
        when_long = 0,
        tim = '';
    tim = setInterval(function() {
        str = '';
        if (++ss == 60) {
            if (++mm == 60) {
                HH++;
                mm = 0;
            }
            ss = 0;
        }
        str += HH < 10 ? "0" + HH : HH;
        str += ":";
        str += mm < 10 ? "0" + mm : mm;
        str += ":";
        str += ss < 10 ? "0" + ss : ss;
        $(".grade>span").html(str);
        if (NumberGame.count == 1) {
            clearInterval(tim);
            when_long = HH * 3600 + mm * 60 + ss;
        }
    }, 1000);
}